#include <iostream>
#include <locale>
#include <math.h>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	//решение с типом переменных float
	float a1 = 1000;
	float b1 = 0.0001;
	float d1 = pow(a1 + b1, 3); //первое действие в числителе 
	float d2 = pow(a1, 3) + 3 * pow(a1, 2) * b1; //второе действие в числителе
	float d3 = d1 - d2; //третье действие в числителе
	float d4 = 3 * a1 * pow(b1, 2) + pow(b1, 3); //действие в знаменателе
	float rezult1 = d3 / d4; //результат выражения
	cout << "Результат выражения с типом переменных float: " << rezult1 << endl;
	//решение с типом переменных double
	double a2 = 1000;
	double b2 = 0.0001;
	double d1_2 = pow(a2 + b2, 3); //первое действие в числителе
	double d2_2 = pow(a2, 3) + 3 * pow(a2, 2) * b2; //второе действие в числителе
	double d3_2 = d1_2 - d2_2; //третье действие в числителе
	double d4_2 = 3 * a2 * pow(b2, 2) + pow(b2, 3); //действие в знаменателе
	double rezult2 = d3_2 / d4_2; //результат выражения
	cout << "Результат выражения с типом переменных double: " << rezult2 << endl;

	return 0;
}
/*Результаты с типами Float и Double сильно отличаются из-за разной точности вычислений.
* Тип Float хранит меньше точных цифр чем double. Из за округления часть точности теряется,
* а при деленипи на очень маленькое число ошибка сильно увеличивается
*
*/