#include <iostream>
#include <locale>
using namespace std;
int main()
{
	setlocale(LC_ALL, ".65001");
	int n, m;
	cout << "Введите значение n: "; //Ввод с клавиатуры пользователем значения n
	cin >> n;
	cout << "Введите значение m: "; //Ввод с клавиатуры пользователем значения m
	cin >> m;
	int rezult1 = m + --n; //значение n уменьшается на 1, складываем m и новое значение n
	cout << "1) m + --n = " << rezult1 << " ,n = " << n << " ,m = " << m << endl;
	int rezult2 = m++ < ++n; //m++ возвращает старое значение m а затем увеличивает на 1, ++n увеличивает n на 1, сравниваем левую и правую часть 0 - ложь 1 - верно
	cout << "2) m++ < ++n = " << rezult2 << " ,n = " << n << " ,m = " << m << endl;
	int rezult3 = n-- < --m; //n-- возвращает старое значение n а затем уменьшает на 1, --m уменьшает значение m на 1 и возвращает новое значение, сравниваем левую и правую часть 0 - ложь 1 - верно
	cout << "3) m-- < --m = " << rezult3 << " ,n = " << n << " ,m = " << m << endl;
	return 0;
}